app/views/comments/_comment.html.erb

<div class="com" style="margin-left: 20px !important;"">
    <pre style="color: blue; font-weight: bold; font-size: 140%"><%= User.find(comment.user_id).name %> : </pre><cite><%= comment.content %></cite>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]