app/views/gossips/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]
---
        <td><%= gossip.content %></td>
        <td><%= gossip.comments.count %></td>
        <td><%= gossip.likes.count %></td>