app/views/gossips/show.html.erb

<!-- #COMPTEUR LIKE -->
<p><%= @gossip.likes.count %> likes </p>
<!-- #COMPTEUR COMMENTAIRE -->
<p><%= @gossip.comments.count %> commentaires </p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]