app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @user=User.find(current_user.id)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "gossip_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hahaha quel drole d'idee"], ["gossip_id", 1], ["user_id", 1], ["created_at", "2018-11-05 23:04:49.967276"], ["updated_at", "2018-11-05 23:04:49.967276"]]
---
    def create
        @gossip = Gossip.find(params[:gossip_id])
        @comment=Comment.create!(user_id: current_user.id, gossip_id: @gossip.id, content: params[:comment][:content])