app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
  @gossips=Gossip.all
  @user= User.find(params[:user_id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."gossip_id" = $2 LIMIT $3  [["user_id", 1], ["gossip_id", 1], ["LIMIT", 1]]
---
  def show
    @gossip=Gossip.find(params[:id])
    @user= User.find(params[:user_id])
    @comment = Comment.new
    @comments = @gossip.comments
    if Like.find_by(user_id: current_user.id, gossip_id: @gossip.id) == nil
      @like = Like.new
      @verif= true
    else
      @verif = false
      @like = Like.find_by(user_id: current_user.id, gossip_id: @gossip.id)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @gossip=Gossip.find(params[:id])

INSERT INTO "gossips" ("title", "content", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hehe"], ["content", "vilain gossip"], ["user_id", 1]]
---
  def create
    @gossip = Gossip.create(user_id: current_user.id, content: params[:gossip][:content], title: params[:gossip][:title])