app/controllers/likes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @user=User.find(current_user.id)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["gossip_id", 1], ["created_at", "2018-11-05 23:04:34.595141"], ["updated_at", "2018-11-05 23:04:34.595141"]]
---
    def create
        @gossip = Gossip.find(params[:gossip_id])
        @like=Like.create!(user_id: current_user.id, gossip_id: @gossip.id)