app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password") VALUES ($1, $2, $3) RETURNING "id"  [["email", "gege@example.fr"], ["name", "gege"], ["password", "gegege"]]
---
   def create
    @user = User.create(user_params)